read_verilog -sv wrapper_nop.v
prep -top wrapper

hierarchy -check
proc
chformal -assume -early;

select wrapper/sanitycheck
chformal -remove
select *

memory ;
flatten
setundef -undriven -expose;
sim -clock clk -reset rst -rstlen 1 -n 1 -w wrapper
write_btor  -s problem_nop.btor2
