read_verilog -sv simple_MAC.v
prep -top simple_MAC

hierarchy -check
setundef -undriven -init -expose
sim -clock clk -reset rst -rstlen 1 -n 1 -w simple_MAC
write_btor  -s simple_MAC.btor2
